{
  "description": "A company make both liquid and foam hand sanitizer. Liquid hand sanitizer requires 40 units of water and 50 units of alcohol. Foam hand sanitizer requires 60 units of water and 40 units of alcohol. The company has available 2000 units of water and 2100 units of alcohol. The number of foam hand sanitizers made must exceed the number of liquid hand sanitizers. In addition, at most 30 liquid hand sanitizers can be made. If each liquid hand sanitizer can clean 30 hands and each foam hand sanitizer can clean 20 hands, how many of each should the company make to maximize the number of hands that can be cleaned?",
  "parameters": {
    "FoodWasteOriginal": {
      "definition": "Amount of food waste generated by the original meal",
      "type": "int",
      "shape": [],
      "value": 20
    },
    "WrappingWasteOriginal": {
      "definition": "Amount of wrapping waste generated by the original meal",
      "type": "int",
      "shape": [],
      "value": 45
    },
    "CookingTimeOriginal": {
      "definition": "Cooking time for the original meal in minutes",
      "type": "int",
      "shape": [],
      "value": 10
    },
    "FoodWasteExperimental": {
      "definition": "Amount of food waste generated by the experimental meal",
      "type": "int",
      "shape": [],
      "value": 25
    },
    "WrappingWasteExperimental": {
      "definition": "Amount of wrapping waste generated by the experimental meal",
      "type": "int",
      "shape": [],
      "value": 35
    },
    "CookingTimeExperimental": {
      "definition": "Cooking time for the experimental meal in minutes",
      "type": "int",
      "shape": [],
      "value": 15
    },
    "MaxFoodWaste": {
      "definition": "Maximum allowable food waste as regulated by the government",
      "type": "int",
      "shape": [],
      "value": 800
    },
    "MaxWrappingWaste": {
      "definition": "Maximum allowable wrapping waste as regulated by the government",
      "type": "int",
      "shape": [],
      "value": 900
    }
  },
  "meta": {
    "problem_name": "demo-ed",
    "created_at": "2025-09-28T11:24:01Z"
  }
}