{
  "description": "A restaurant has two combos available to their customers, an original and an experimental meal. The original meal typically generates 20 units of food waste and 45 units of wrapping waste and takes 10 minutes to cook. In comparison, the experimental meal generates 25 units of food waste and 35 units of wrapping waste and takes 15 minutes to cook. The restaurant can have at most 900 units of wrapping waste and can have at most 800 units of food waste as regulated by the government. How many of each combo should be pushed for by the waiting staff to minimize the cooking time?",
  "parameters": {
    "FoodWasteOriginal": {
      "definition": "Food waste generated by the original meal combo",
      "type": "int",
      "shape": [],
      "value": 20
    },
    "WrappingWasteOriginal": {
      "definition": "Wrapping waste generated by the original meal combo",
      "type": "int",
      "shape": [],
      "value": 45
    },
    "CookingTimeOriginal": {
      "definition": "Cooking time for the original meal combo in minutes",
      "type": "int",
      "shape": [],
      "value": 10
    },
    "FoodWasteExperimental": {
      "definition": "Food waste generated by the experimental meal combo",
      "type": "int",
      "shape": [],
      "value": 25
    },
    "WrappingWasteExperimental": {
      "definition": "Wrapping waste generated by the experimental meal combo",
      "type": "int",
      "shape": [],
      "value": 35
    },
    "CookingTimeExperimental": {
      "definition": "Cooking time for the experimental meal combo in minutes",
      "type": "int",
      "shape": [],
      "value": 15
    },
    "MaxFoodWaste": {
      "definition": "Maximum allowable food waste as regulated by the government",
      "type": "int",
      "shape": [],
      "value": 800
    },
    "MaxWrappingWaste": {
      "definition": "Maximum allowable wrapping waste as regulated by the government",
      "type": "int",
      "shape": [],
      "value": 900
    }
  },
  "meta": {
    "problem_name": "demo-ed",
    "created_at": "2025-09-28T08:24:28Z"
  },
  "objective": {
    "description": "Minimize the total cooking time by determining how many of each combo (original and experimental) should be promoted, subject to the constraints on food waste and wrapping waste.",
    "formulation": null,
    "code": null
  },
  "constraints": [
    {
      "description": "The total food waste from original and experimental meals must not exceed 800 units.",
      "formulation": null,
      "code": null
    },
    {
      "description": "The total wrapping waste from original and experimental meals must not exceed 900 units.",
      "formulation": null,
      "code": null
    },
    {
      "description": "The number of original meals must be non-negative.",
      "formulation": null,
      "code": null
    },
    {
      "description": "The number of experimental meals must be non-negative.",
      "formulation": null,
      "code": null
    }
  ]
}